src/InformationRegisters/ОценкаПроизводительностиКлючевыеОперации/ОценкаПроизводительностиКлючевыеОперации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОценкаПроизводительностиКлючевыеОперации</name>
  <resources>
    <name>Приоритет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЦелевоеВремя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МинимальноДопустимыйУровень</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПриоритетВИБ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЦелевоеВремяВИБ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ВыполненаСОшибкой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПомеченаНаУдаление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>УникальныйИдентификатор</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИнформационнаяБаза</name>
    <type>
      <types>CatalogRef.ОбъектыКонтроля</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ОценкаПроизводительностиКлючевыеОперации/Forms/ФормаСпискаВнутренниеЗамеры/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    Список.Параметры.УстановитьЗначениеПараметра("ИнформационнаяБаза", Справочники.ОбъектыКонтроля.ПолучитьСсылкуПоНаименованию("Центр контроля качества"));
    
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
    
    Если Поле.Имя = "ПомеченаНаУдаление" Тогда
        
        ИзменитьОтключить(ВыбраннаяСтрока);
        СтандартнаяОбработка = Ложь;
        
    Иначе
        
        ПараметрыОткрытия = Новый Структура("Ключ", ВыбраннаяСтрока);
        ОткрытьФорму("РегистрСведений.ОценкаПроизводительностиКлючевыеОперации.Форма.ФормаЗаписиВнутренниеЗамеры", ПараметрыОткрытия);
        СтандартнаяОбработка = Ложь;
        
    КонецЕсли;
    
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ИзменитьОтключить(КлючЗаписи)
    
    МенеджерЗаписи = РегистрыСведений.ОценкаПроизводительностиКлючевыеОперации.СоздатьМенеджерЗаписи();
    МенеджерЗаписи.УникальныйИдентификатор = КлючЗаписи.УникальныйИдентификатор;
    МенеджерЗаписи.ИнформационнаяБаза = КлючЗаписи.ИнформационнаяБаза;
    МенеджерЗаписи.Прочитать();
    
    МенеджерЗаписи.УникальныйИдентификатор = КлючЗаписи.УникальныйИдентификатор;
    МенеджерЗаписи.ИнформационнаяБаза = КлючЗаписи.ИнформационнаяБаза;
    МенеджерЗаписи.ПомеченаНаУдаление = НЕ МенеджерЗаписи.ПомеченаНаУдаление;
    
    МенеджерЗаписи.Записать(Истина);
    
    Элементы.Список.Обновить();
        
КонецПроцедуры

#КонецОбласти
